package com.homeminus.controller;
//package com.homeminus.controller;
//
//public class MainController {
//	
//	public void controll() {
//		//서비스, 뷰(화면처리) 용 인스턴스 생성
//		
//		//메뉴 입력용 변수
//		int menu = 0;
//		
//		//프로그램 무한 반복 처리
//		while(true) {
//			//타이틀과 메인 출력
//			
//			//메뉴 번호 입력 받기
//			//menu = 뷰 클래스의 번호입력받는 메소드 실행.
//			
//			//종료처리
//			if(menu == 0) {
//				//종료 메시지 출력
//				break;//또는 return;
//			}
//			
//			//메뉴 분기 처리
//			switch(menu) {
//			case 1://제품 등록
//				regProduct();
//				break;
//			case 2://제품 출력
//				break;
//			case 3://제품 검색
//				break;
//			case 4://제품 수정
//				break;
//			case 5://제품 삭제
//				break;
//			default:
//				//잘못된 메뉴 번호 입력에 대한 메시지 출력
//			}//switch 끝
//		}//while 끝
//	}//controll 메소드 끝
//	
//	//제품 등록 용 메소드
//	public void regProduct() {
//		//서브메뉴 입력용 변수
//		int sub = 0;
//		
//		//돌아가기 메뉴가 선택되기 전까지 무한반복
//		while(true) {
//			//서브타이틀/서브메뉴 출력
//			
//			//서브메뉴 입력
//			//sub = 뷰 클래스의 번호입력받는 메소드 실행.
//			
//			if(sub == 0) {
//				//돌아기기 메시지 출력
//				return;
//			}
//			
//			//서브메뉴 분기 처리
//			switch(sub) {
//			case 1://가전제품 등록
//				//뷰 클래스에서 입력 받기
//				//서비스 클래스에서 저장
//				break;
//			case 2://생필품 등록
//				//뷰 클래스에서 입력 받기
//				//서비스 클래스에서 저장
//				break;
//			case 3://식품 등록
//				//뷰 클래스에서 입력 받기
//				//서비스 클래스에서 저장
//				break;
//			default:
//				//잘못된 메뉴 번호 입력에 대한 메시지 출력
//			}
//		}
//		
//	}
//	
//	//제품 출력 용 메소드
//	public void printProduct() {
//		//2가지 출력 형태(서브메뉴)
//		//1. 전체 출력
//		//2. 카테고리별 출력
//		//0. 돌아가기
//		
//		//서브메뉴 입력용 변수
//		int sub = 0;
//		
//		//돌아가기 메뉴가 선택되기 전까지 무한반복
//		while(true) {
//			//서브타이틀/서브메뉴 출력
//			
//			//서브메뉴 입력
//			//sub = 뷰 클래스의 번호입력받는 메소드 실행.
//			
//			if(sub == 0) {
//				//돌아기기 메시지 출력
//				return;
//			}
//			
//			switch(sub) {
//			case 1://전체 출력
//				break;
//			case 2://카테고리별 출력(카테고리 서브 메뉴처리)
//				//카테고리별 출력 메소드 실행
//				break;
//			default:
//				//잘못된 메뉴 번호 입력에 대한 메시지 출력
//			}
//		}
//	}
//	
//	//카테고리별 출력 용 메소드
//	public void printCate(/*제품 목록*/) {
//		//메뉴 번호 입력 변수
//		int sub = 0;
//		
//		while(true) {
//			//카테고리 서브 메뉴 출력
//			//(제품 등록에서 사용한 메뉴 재활용)
//			
//			//서브메뉴 입력
//			//sub = 뷰 클래스의 번호입력받는 메소드 실행.
//			
//			if(sub == 0) {
//				//돌아기기 메시지 출력
//				return;
//			}
//			
//			//뷰 클래스의 카테고리별 출력 메소드 사용
//			
//		}
//	}
//	
//	//제품 검색 용 메소드
//	
//	//제품 수정 용 메소드
//	
//	//제품 삭제 용 메소드
//		//1. 전체 삭제
//		//2. 검색 삭제
//}//클래스 끝







